const regType = {
    password: {
        index: /^(\w){6,20}$/, // 只能输入6-20个字母、数字、下划线 
        week: /^(?:\d+|[a-zA-Z]+|[!@#$%^&*]+)$/, //弱：纯数字，纯字母，纯特殊字符
        middle: /^(?![a-zA-z]+$)(?!\d+$)(?![!@#$%^&*]+$)[a-zA-Z\d!@#$%^&*]+$/, // 中：字母+数字，字母+特殊字符，数字+特殊字符
        strong: /^(?![a-zA-z]+$)(?!\d+$)(?![!@#$%^&*]+$)(?![a-zA-z\d]+$)(?![a-zA-z!@#$%^&*]+$)(?![\d!@#$%^&*]+$)[a-zA-Z\d!@#$%^&*]+$/, ///强：字母+数字+特殊字符
    },
    phone: /^1[3|4|5|7|8][0-9]{9}$/,
    account: {
        maxLength: 20, // 用户名最大长度
        minLength: 6 // 用户名最小长度

    }
}

export default regType;